In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## Завдання 2

Робота з файлом даних "Титанік" Наведені нижче завдання ґрунтуються на даних 'titanic.csv', де міститься інформація про пасажирів «Титаніка».

### Завдання:
1. Яка кількість чоловіків та жінок пливла на кораблі?
2. Яку частину пасажирів вдалося вижити? Порахуйте частку пасажирів, що вижили. Відповідь наведіть у відсотках (число в інтервалі від 0 до 100, знак відсотка не потрібен), округливши до двох символів.
3. Яку частку пасажири першого класу складали серед всіх пасажирів? Відповідь наведіть у відсотках (число в інтервалі від 0 до 100, знак відсотка не потрібний), округливши до двох знаків.
4. Якого віку були пасажири? Порахуйте середнє та медіану віку пасажирів. Як відповідь наведіть дві числа через пропуск.

In [7]:
gender_counts = df['sex'].value_counts()
print(gender_counts)

sex
male      577
female    314
Name: count, dtype: int64

In [9]:
survival_rate = df['survived'].mean() * 100
print(f'Частка вижилих пасажирів: {survival_rate:.2f}%')

Частка вижилих пасажирів: 38.38%

In [13]:
first_class_rate = df['pclass'].value_counts(normalize=True).get(1, 0) * 100
print(f'Частка пасажирів першого класу: {first_class_rate:.2f}%')

Частка пасажирів першого класу: 24.24%

In [12]:
average_age = df['age'].mean()
median_age = df['age'].median()
print(f'Середній вік пасажирів: {average_age:.2f}')
print(f'Медіанний вік пасажирів: {median_age:.2f}')

Середній вік пасажирів: 29.70
Медіанний вік пасажирів: 28.00